app/views/projects/_project.html.erb

SELECT "images".* FROM "images" WHERE "images"."project_id" = 1
---
			<div id="myGallery">
			<% @project.images.each do |image| %>