app/controllers/admin_controller.rb

INSERT INTO "projects" ("brief", "client", "created_at", "date_added", "is_featured", "is_published", "outcome", "project_type", "solution", "thumbnail_content_type", "thumbnail_file_name", "thumbnail_file_size", "thumbnail_updated_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  	def create
    	@project = Project.new(params[:project])
      @project.date_added = Time.now.year
    	respond_to do |format|
      		if project = @project.save

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @project = Project.find(params[:id])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "project_type" = 0, "thumbnail_file_name" = 'Grey-circle-header.png', "thumbnail_content_type" = 'image/png', "thumbnail_file_size" = 113284, "thumbnail_updated_at" = '2012-08-17 05:59:48.404555', "updated_at" = '2012-08-17 05:59:48.405157' WHERE "projects"."id" = 1
---
  def update
    @project = Project.find(params[:id])

    respond_to do |format|
      if @project.update_attributes(params[:project])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 2]]
---
  def delete
    @project = Project.find(params[:id])
    @project.destroy

SELECT "images".* FROM "images" WHERE "images"."project_id" = 1
---
  def images
    @images = Image.where(:project_id => params[:project_id])

INSERT INTO "images" ("image_content_type", "image_file_name", "image_file_size", "image_updated_at", "project_id") VALUES (?, ?, ?, ?, ?)  [["image_content_type", "image/png"], ["image_file_name", "placeholder-image.png"], ["image_file_size", 362704], ["image_updated_at", Fri, 17 Aug 2012 08:02:15 UTC +00:00], ["project_id", 1]]
---
  def create_image
    @image = Image.new(params[:image])
    if @image.save