app/controllers/projects_controller.rb

  def design
    @projects = Project.where(:is_featured => true,:project_type => 0).limit(10)
    @project = @projects.first()
---
SELECT "projects".* FROM "projects" WHERE "projects"."is_featured" = 't' AND "projects"."project_type" = 0
SELECT "projects".* FROM "projects" WHERE "projects"."is_featured" = 't' AND "projects"."project_type" = 0 LIMIT 1

  def illustration
    @projects = Project.where(:is_featured => true, :project_type => 1).limit(10)
    @project = @projects.first()
---
SELECT "projects".* FROM "projects" WHERE "projects"."is_featured" = 't' AND "projects"."project_type" = 1
SELECT "projects".* FROM "projects" WHERE "projects"."is_featured" = 't' AND "projects"."project_type" = 1 LIMIT 1

  def miscellaneous
    @projects = Project.where(:is_featured => true, :project_type => 2).limit(10)
    @project = @projects.first()
---
SELECT "projects".* FROM "projects" WHERE "projects"."is_featured" = 't' AND "projects"."project_type" = 2
SELECT "projects".* FROM "projects" WHERE "projects"."is_featured" = 't' AND "projects"."project_type" = 2 LIMIT 1

  def published
    @projects = Project.where(:is_published => true)
---
SELECT "projects".* FROM "projects" WHERE "projects"."is_published" = 't' LIMIT 1

  def attic
    @projects = Project.all
---
SELECT "projects".* FROM "projects"