app/controllers/projects_controller.rb

  def illiustration
    @projects = Project.where(:is_featured => true, :project_type => 1)
---
SELECT "projects".* FROM "projects" WHERE "projects"."is_featured" = 't' AND "projects"."project_type" = 1 LIMIT 1